In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

# Working with Dates

In [5]:
# converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# Extract year

In [9]:
date['date_year'] = date['date'].dt.year

In [11]:
date.sample(5)

          date  product_id  city_id  orders  date_month_no  date_year
440 2018-10-31        4382       23       5             10       2018
435 2018-10-20        4847       26       9             10       2018
598 2018-09-07        1134       13      19              9       2018
339 2019-12-05        6135       28       1             12       2019
223 2019-07-18        4529       20       5              7       2019

#  Extract Month

In [12]:

date['date_month_no'] = date['date'].dt.month
date.head()

        date  product_id  city_id  orders  date_month_no  date_year
0 2019-12-10        5628       25       3             12       2019
1 2018-08-15        3646       14     157              8       2018
2 2018-10-23        1859       25       1             10       2018
3 2019-08-17        7292       25       1              8       2019
4 2019-01-06        4344       25       3              1       2019

# Extract days

In [13]:
date['date_day'] = date['date'].dt.day
date.head()

        date  product_id  city_id  orders  date_month_no  date_year  date_day
0 2019-12-10        5628       25       3             12       2019        10
1 2018-08-15        3646       14     157              8       2018        15
2 2018-10-23        1859       25       1             10       2018        23
3 2019-08-17        7292       25       1              8       2019        17
4 2019-01-06        4344       25       3              1       2019         6

# Day of week

In [14]:
date['date_dow'] = date['date'].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_month_no,date_year,date_day,date_dow
0,2019-12-10,5628,25,3,12,2019,10,1
1,2018-08-15,3646,14,157,8,2018,15,2
2,2018-10-23,1859,25,1,10,2018,23,1
3,2019-08-17,7292,25,1,8,2019,17,5
4,2019-01-06,4344,25,3,1,2019,6,6

# Day of week name

In [15]:
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id', 'city_id','orders']).head()

        date  date_month_no  date_year  date_day  date_dow date_dow_name
0 2019-12-10             12       2019        10         1       Tuesday
1 2018-08-15              8       2018        15         2     Wednesday
2 2018-10-23             10       2018        23         1       Tuesday
3 2019-08-17              8       2019        17         5      Saturday
4 2019-01-06              1       2019         6         6        Sunday

# is weekend

In [18]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']),1,0)
date.drop(columns=['product_id', 'city_id','orders']).head()

,date,date_month_no,date_year,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,12,2019,10,1,Tuesday,0
1,2018-08-15,8,2018,15,2,Wednesday,0
2,2018-10-23,10,2018,23,1,Tuesday,0
3,2019-08-17,8,2019,17,5,Saturday,1
4,2019-01-06,1,2019,6,6,Sunday,1

# Extract week of the year

In [22]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_month_no,date_year,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,12,2019,10,1,Tuesday,0,50
1,2018-08-15,8,2018,15,2,Wednesday,0,33
2,2018-10-23,10,2018,23,1,Tuesday,0,43
3,2019-08-17,8,2019,17,5,Saturday,1,33
4,2019-01-06,1,2019,6,6,Sunday,1,1

# Extract Quarter

In [29]:
date['quarter'] = date['date'].dt.quarter

date.head()

,date,date_month_no,date_year,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,12,2019,10,1,Tuesday,0,50,4
1,2018-08-15,8,2018,15,2,Wednesday,0,33,3
2,2018-10-23,10,2018,23,1,Tuesday,0,43,4
3,2019-08-17,8,2019,17,5,Saturday,1,33,3
4,2019-01-06,1,2019,6,6,Sunday,1,1,1

# Extract Semester

In [31]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)
date.head()

,date,date_month_no,date_year,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,12,2019,10,1,Tuesday,0,50,4,2
1,2018-08-15,8,2018,15,2,Wednesday,0,33,3,2
2,2018-10-23,10,2018,23,1,Tuesday,0,43,4,2
3,2019-08-17,8,2019,17,5,Saturday,1,33,3,2
4,2019-01-06,1,2019,6,6,Sunday,1,1,1,1

# Extract Time elapsed between dates

In [32]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2024, 1, 23, 23, 2, 57, 296713)

In [33]:
today - date['date']

0     1505 days 23:02:57.296713
1     1987 days 23:02:57.296713
2     1918 days 23:02:57.296713
3     1620 days 23:02:57.296713
4     1843 days 23:02:57.296713
                 ...
995   1933 days 23:02:57.296713
996   1874 days 23:02:57.296713
997   1722 days 23:02:57.296713
998   1787 days 23:02:57.296713
999   1561 days 23:02:57.296713
Name: date, Length: 1000, dtype: timedelta64[ns]

In [34]:
(today - date['date']).dt.days

0      1505
1      1987
2      1918
3      1620
4      1843
       ...
995    1933
996    1874
997    1722
998    1787
999    1561
Name: date, Length: 1000, dtype: int64

In [35]:
# Months passed
np.round((today - date['date']) / np.timedelta64(1,'M'),0)

0      49.0
1      64.0
2      62.0
3      52.0
4      59.0
       ...
995    62.0
996    60.0
997    56.0
998    58.0
999    50.0
Name: date, Length: 1000, dtype: float64

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# converting to datetime datatype

In [37]:
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [38]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [39]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

## Time Difference

In [40]:
today - time['date']

0     3691 days 22:12:57.296713
1     3555 days 23:22:57.296713
2     4041 days 22:41:57.296713
3     3343 days 22:31:57.296713
4     3740 days 23:51:57.296713
                 ...
995   4330 days 22:12:57.296713
996   3651 days 23:48:57.296713
997   4116 days 23:25:57.296713
998   4232 days 23:28:57.296713
999   3504 days 23:37:57.296713
Name: date, Length: 1000, dtype: timedelta64[ns]

# IN seconds

In [41]:
(today - time['date']) / np.timedelta64(1,'s')

0      3.189824e+08
1      3.072362e+08
2      3.492241e+08
3      2.889163e+08
4      3.232219e+08
           ...
995    3.741920e+08
996    3.155321e+08
997    3.557068e+08
998    3.657293e+08
999    3.028307e+08
Name: date, Length: 1000, dtype: float64

In [42]:
# In minutes
(today - time['date']) / np.timedelta64(1,'m')

0      5.316373e+06
1      5.120603e+06
2      5.820402e+06
3      4.815272e+06
4      5.387032e+06
           ...
995    6.236533e+06
996    5.258869e+06
997    5.928446e+06
998    6.095489e+06
999    5.047178e+06
Name: date, Length: 1000, dtype: float64

In [43]:
# In hours
(today - time['date'])/ np.timedelta64(1,'h')

0       88606.215916
1       85343.382582
2       97006.699249
3       80254.532582
4       89783.865916
           ...
995    103942.215916
996     87647.815916
997     98807.432582
998    101591.482582
999     84119.632582
Name: date, Length: 1000, dtype: float64